Router(config)#hostname R-01
R-01(config)#int
R-01(config)#interface gig
R-01(config)#interface gigabitEthernet 0/0/0
R-01(config-if)#desc
R-01(config-if)#description SW-01 Link
R-01(config-if)#ip add
R-01(config-if)#ip address 172.16.10.254 255.255.255.128
R-01(config-if)#ip he
R-01(config-if)#ip hel
R-01(config-if)#ip help
R-01(config-if)#ip helper-address 172.16.0.2
R-01(config-if)#no shutdown

R-01(config-if)#
R-01(config-if)#exit
R-01(config)#interface gigabitEthernet 0/0/1
R-01(config-if)#description SW-02 Link
R-01(config-if)#ip address 172.16.8.254 255.255.255.0
R-01(config-if)#ip helper-address 172.16.0.2
R-01(config-if)#no shutdown

R-01(config-if)#exit
R-01(config)#inter
R-01(config)#interface se
R-01(config)#interface serial 0/1/0
R-01(config-if)#description R-02 Link
R-01(config-if)#ip address 172.16.11.225 255.255.255.252
R-01(config-if)#no shutdown


R-01(config)#ip route 172.16.10.0 255.255.255.128 172.16.11.226 121
R-01(config)#ip route 172.16.11.64 255.255.255.192 172.16.11.226 121
R-01(config)#ip route 172.16.11.192 255.255.255.224 172.16.11.226 121 
R-01(config)#ip route 172.16.9.0 255.255.255.128 172.16.11.226 121 
R-01(config)#ip route 172.16.11.0 255.255.255.192 172.16.11.226 121
R-01(config)#ip route 172.16.0.0 255.255.248.0 172.16.11.226 121 
R-01(config)#ip route 172.16.9.128 255.255.255.128 172.16.11.226 121
R-01(config)#ip route 172.16.11.128 255.255.255.224 172.16.11.226 121

R-01(config)#router rip
R-01(config-router)#version 2
R-01(config-router)#network 172.16.10.128
R-01(config-router)#network 172.16.8.0
R-01(config-router)#network 172.16.11.224
R-01(config-router)#no auto
R-01(config-router)#no auto-summary 
R-01(config-router)#exit


R-01#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
R-01#
R-01#cop
R-01#copy r
R-01#copy running-config tftp
Address or name of remote host []? 172.16.0.1
Destination filename [R-01-confg]? 

Writing running-config...!!
[OK - 1423 bytes]

R-01#clock set 18:30:00 07 october 2025
R-01#
R-01#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R-01(config)#
R-01(config)#banner motd *
Enter TEXT message.  End with the character '*'.

###################################################
This is Secure area. Please Enter your Authentication.
#################################################### *


R-01(config)#enable secret Eranda@2520.lk
R-01(config)#
R-01(config)#line console 0
R-01(config-line)#
R-01(config-line)#password eRanda@2024.lk
R-01(config-line)#exec-timeout 10
R-01(config-line)#login
R-01(config-line)#exit
R-01(config)#
R-01(config)#security passwords min-length 8
R-01(config)#ip domain-name sltsc.lk
R-01(config)#crypto key generate rsa
The name for the keys will be: R-01.sltsc.lk
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1028
% Generating 1028 bit RSA keys, keys will be non-exportable...[OK]

R-01(config)#username sshadmin secret Eranda@SLTsc.lk
*Oct 7 18:30:15.475: %SSH-5-ENABLED: SSH 1.99 has been enabled
R-01(config)#
R-01(config)#line vty 0
R-01(config-line)#transport input ssh
R-01(config-line)#login local 
R-01(config-line)#exec-timeout 10
R-01(config-line)#login local 
R-01(config-line)#exit
R-01(config)#
R-01(config)#login block-for 900 attempts 2 within 60