Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R-04
R-04(config)#int
R-04(config)#interface gig
R-04(config)#interface gigabitEthernet 0/0/0
R-04(config-if)#des
R-04(config-if)#description SW-06 Link
R-04(config-if)#ip add
R-04(config-if)#ip address 172.16.11.126 255.255.255.192
R-04(config-if)#ip help
R-04(config-if)#ip helper-address 172.16.0.2
R-04(config-if)#no shut
R-04(config-if)#no shutdown 

R-04(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

R-04(config-if)#exit
R-04(config)#interface gigabitEthernet 0/0/1
R-04(config-if)#description SW-07 Link
R-04(config-if)#ip address 172.16.10.126 255.255.255.128
R-04(config-if)#ip helper-address 172.16.0.2
R-04(config-if)#no shutdown 

R-04(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/1, changed state to up

R-04(config-if)#exit
R-04(config)#int
R-04(config)#interface se
R-04(config)#interface serial 0/2/0
R-04(config-if)#description R-02 Link
R-04(config-if)#ip address 172.16.11.233 255.255.255.252
R-04(config-if)#no shutdown 

R-04(config)#ip route 172.16.0.0 255.255.248.0 172.16.11.234 121
R-04(config)#ip route 172.16.9.128 255.255.255.128 172.16.11.234 121 
R-04(config)#ip route 172.16.11.192 255.255.255.224 172.16.11.234 121
R-04(config)#ip route 172.16.10.128 255.255.255.128 172.16.11.234 121
R-04(config)#ip route 172.16.8.0 255.255.255.0 172.16.11.234 121 
R-04(config)#ip route 172.16.9.0 255.255.255.128 172.16.11.234 121
R-04(config)#ip route 172.16.11.0 255.255.255.192 172.16.11.234 121
R-04(config)#ip route 172.16.11.128 255.255.255.224 172.16.11.234 121
 

R-04(config)#router rip
R-04(config-router)#version 2
R-04(config-router)#network 172.16.11.64
R-04(config-router)#network 172.16.10.0
R-04(config-router)#network 172.16.11.232
R-04(config-router)#no au
R-04(config-router)#no auto-summary 
R-04(config-router)#exit


R-04#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
R-04#
R-04#cop
R-04#copy r
R-04#copy running-config tftp
Address or name of remote host []? 172.16.0.1
Destination filename [R-04-confg]? 

Writing running-config...!!
[OK - 1424 bytes]



R-04#clock set 18:30:00 07 october 2025
R-04#
R-04#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R-04(config)#
R-04(config)#banner motd *
Enter TEXT message.  End with the character '*'.

###################################################
This is Secure area. Please Enter your Authentication.
#################################################### *

R-04(config)#
R-04(config)#enable secret Eranda@2520.lk
R-04(config)#
R-04(config)#line console 0
R-04(config-line)#
R-04(config-line)#password eRanda@2024.lk
R-04(config-line)#exec-timeout 10
R-04(config-line)#login
R-04(config-line)#exit
R-04(config)#
R-04(config)#security passwords min-length 8
R-04(config)#ip domain-name sltsc.lk
R-04(config)#crypto key generate rsa 
The name for the keys will be: R-04.sltsc.lk
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1028
% Generating 1028 bit RSA keys, keys will be non-exportable...[OK]

R-04(config)#username sshadmin secret Eranda@SLTsc.lk
*Oct 7 18:30:5.239: %SSH-5-ENABLED: SSH 1.99 has been enabled
R-04(config)#
R-04(config)#line vty 0
R-04(config-line)#transport input ssh
R-04(config-line)#login local 
R-04(config-line)#exec-timeout 10
R-04(config-line)#login local 
R-04(config-line)#exit
R-04(config)#
R-04(config)#login block-for 900 attempts 2 within 60