Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R-05
R-05(config)#int
R-05(config)#interface gig
R-05(config)#interface gigabitEthernet 0/0/0
R-05(config-if)#des
R-05(config-if)#description SW-08 Link
R-05(config-if)#ip add
R-05(config-if)#ip address 172.16.9.254 255.255.255.128
R-05(config-if)#ip help
R-05(config-if)#ip helper-address 172.16.0.2
R-05(config-if)#no shutdown

R-05(config-if)#exit
R-05(config)#interface gigabitEthernet 0/0/1
R-05(config-if)#description SW-09 Link
R-05(config-if)#ip address 172.16.7.254 255.255.248.0
R-05(config-if)#ip helper-address 172.16.0.2
R-05(config-if)#no shutdown

R-05(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/1, changed state to up

R-05(config-if)#exit
R-05(config)#in
R-05(config)#interface se
R-05(config)#interface serial 0/2/1
R-05(config-if)#description R-02 Link
R-05(config-if)#ip address 172.16.11.237 255.255.255.252
R-05(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/2/1, changed state to down
R-05(config-if)#
R-05(config-if)#exit


R-05(config)#ip route 172.16.10.0 255.255.255.128 172.16.11.238 121
R-05(config)#ip route 172.16.11.64 255.255.255.192 172.16.11.238 121
R-05(config)#ip route 172.16.11.192 255.255.255.224 172.16.11.238 121
R-05(config)#ip route 172.16.10.128 255.255.255.128 172.16.11.238 121
R-05(config)#ip route 172.16.8.0 255.255.255.0 172.16.11.238 121
R-05(config)#ip route 172.16.9.0 255.255.255.128 172.16.11.238 121
R-05(config)#ip route 172.16.11.0 255.255.255.192 172.16.11.238 121 
R-05(config)#ip route 172.16.11.128 255.255.255.192 172.16.11.238 121

R-05(config)#router rip
R-05(config-router)#vers
R-05(config-router)#version 2
R-05(config-router)#network 172.16.0.0
R-05(config-router)#network 172.16.9.128
R-05(config-router)#network 172.16.11.236
R-05(config-router)#no aut
R-05(config-router)#no auto-summary 
R-05(config-router)#

R-05#clock set 18:30:00 07 october 2025
R-05#
R-05#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R-05(config)#
R-05(config)#banner motd *
Enter TEXT message.  End with the character '*'.

###################################################
This is Secure area. Please Enter your Authentication.
#################################################### *

R-05(config)#
R-05(config)#enable secret Eranda@2520.lk
R-05(config)#
R-05(config)#line console 0
R-05(config-line)#
R-05(config-line)#password eRanda@2024.lk
R-05(config-line)#exec-timeout 10
R-05(config-line)#login
R-05(config-line)#exit
R-05(config)#
R-05(config)#security passwords min-length 8
R-05(config)#ip domain-name sltsc.lk
R-05(config)#crypto key generate rsa 
The name for the keys will be: R-05.sltsc.lk
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1028
% Generating 1028 bit RSA keys, keys will be non-exportable...[OK]

R-05(config)#username sshadmin secret Eranda@SLTsc.lk
*Oct 7 18:30:5.77: %SSH-5-ENABLED: SSH 1.99 has been enabled
R-05(config)#
R-05(config)#line vty 0
R-05(config-line)#transport input ssh
R-05(config-line)#login local 
R-05(config-line)#exec-timeout 10
R-05(config-line)#login local 
R-05(config-line)#exit
R-05(config)#
R-05(config)#login block-for 900 attempts 2 within 60
R-05(config)#